#
#
# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#       http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
#
#

BeamEnginesFlink.OptionsAutoWatermarkInterval.Label=Intervalo autom\u00E1tico de marca d'\u00E1gua
BeamEnginesFlink.OptionsAutoWatermarkInterval.ToolTip=O intervalo em milissegundos para emiss\u00E3o autom\u00E1tica de marca d'\u00E1gua.
BeamEnginesFlink.OptionsCheckpointInterval.Label=Intervalo de verifica\u00E7\u00E3o
BeamEnginesFlink.OptionsCheckpointInterval.ToolTip=O intervalo em milissegundos no qual acionar pontos de verifica\u00E7\u00E3o do Pipeline em execu\u00E7\u00E3o. Padr\u00E3o: Sem ponto de verifica\u00E7\u00E3o.
BeamEnginesFlink.OptionsCheckpointMode.Label=Modo de verifica\u00E7\u00E3o
BeamEnginesFlink.OptionsCheckpointMode.ToolTip=O modo de ponto de verifica\u00E7\u00E3o que define a garantia de consist\u00EAncia.
BeamEnginesFlink.OptionsCheckpointTimeout.Label=Tempo limite de verifica\u00E7\u00E3o (ms)
BeamEnginesFlink.OptionsCheckpointTimeout.ToolTip=O tempo m\u00E1ximo em milissegundos que um ponto de verifica\u00E7\u00E3o pode levar antes de ser descartado.
BeamEnginesFlink.OptionsDisableMetrics.Label=Desabilitar m\u00E9tricas
BeamEnginesFlink.OptionsDisableMetrics.ToolTip=Desativar m\u00E9tricas do Beam no Flink Runner
BeamEnginesFlink.OptionsExecutionModeForBatch.Label=Modo de execu\u00E7\u00E3o em lote
BeamEnginesFlink.OptionsExecutionModeForBatch.ToolTip=Modo do Flink para troca de dados de Pipelines em lote. Defina como BATCH_FORCED se os Pipelines forem bloqueados, consulte https://issues.apache.org/jira/browse/FLINK-10672
BeamEnginesFlink.OptionsExternalizedCheckpointsEnabled.Label=Desabilitar pontos de verifica\u00E7\u00E3o externalizados
BeamEnginesFlink.OptionsExternalizedCheckpointsEnabled.ToolTip=Ativa ou desativa pontos de verifica\u00E7\u00E3o externalizados. Funciona em conjunto com CheckpointingInterval
BeamEnginesFlink.OptionsFailOnCheckpointErrors.Label=Falha em erros de checkpoint?
BeamEnginesFlink.OptionsFailOnCheckpointErrors.ToolTip=Define o comportamento esperado para tarefas caso encontrem um erro em seu procedimento de ponto de verifica\u00E7\u00E3o. Se isso for definido como verdadeiro, a tarefa falhar\u00E1 no erro de ponto de verifica\u00E7\u00E3o. Se for definido como falso, a tarefa apenas recusar\u00E1 o ponto de verifica\u00E7\u00E3o e continuar\u00E1 em execu\u00E7\u00E3o. 
BeamEnginesFlink.OptionsLatencyTrackingInterval.Label=Intervalo de rastreamento de lat\u00EAncia
BeamEnginesFlink.OptionsLatencyTrackingInterval.ToolTip=Intervalo em milissegundos para envio de marcas de rastreamento de lat\u00EAncia das fontes para os coletores. Valor de intervalo <= 0 desativa o recurso.
BeamEnginesFlink.OptionsMaster.Label=O Flink master
BeamEnginesFlink.OptionsMaster.ToolTip=Endere\u00E7o do Flink Master onde o Pipeline dever\u00E1 ser executado. Pode ter o formato "host:port" ou um dos valores especiais [local], [cole\u00E7\u00E3o] ou [auto].
BeamEnginesFlink.OptionsMaxBundleSize.Label=Tamanho m\u00E1ximo do pacote
BeamEnginesFlink.OptionsMaxBundleSize.ToolTip=O n\u00FAmero m\u00E1ximo de elementos em um pacote configur\u00E1vel.
BeamEnginesFlink.OptionsMaxBundleTimeMills.Label=Tempo m\u00E1ximo do pacote (ms)
BeamEnginesFlink.OptionsMaxBundleTimeMills.ToolTip=O tempo m\u00E1ximo de espera antes de finalizar um pacote (em milissegundos).
BeamEnginesFlink.OptionsNumberOfRetries.Label=N\u00FAmero de novas tentativas de execu\u00E7\u00E3o
BeamEnginesFlink.OptionsNumberOfRetries.ToolTip=Define o n\u00FAmero de vezes que as tarefas com falha s\u00E3o executadas novamente. Um valor zero desativa efetivamente a toler\u00E2ncia a falhas. Um valor -1 indica que o valor padr\u00E3o do sistema (conforme definido na configura\u00E7\u00E3o) deve ser usado.
BeamEnginesFlink.OptionsObjectReuse.Label=Reutiliza\u00E7\u00E3o de objetos
BeamEnginesFlink.OptionsObjectReuse.ToolTip=Define o comportamento de reutiliza\u00E7\u00E3o de objetos.
BeamEnginesFlink.OptionsParallelism.Label=Paralelismo
BeamEnginesFlink.OptionsParallelism.ToolTip=O grau de paralelismo a ser usado ao distribuir opera\u00E7\u00F5es aos workers. Se o paralelismo n\u00E3o estiver definido, o padr\u00E3o configurado do Flink ser\u00E1 usado, ou 1 se nenhum puder ser encontrado.
BeamEnginesFlink.OptionsPauseBetweenCheckpoints.Label=Pausa m\u00EDnima entre pontos de verifica\u00E7\u00E3o
BeamEnginesFlink.OptionsPauseBetweenCheckpoints.ToolTip=A pausa m\u00EDnima em milissegundos antes do pr\u00F3ximo ponto de verifica\u00E7\u00E3o ser acionado.
BeamEnginesFlink.OptionsRetainExternalizedCheckpointsOnCancellation.Label=Retenha pontos de verifica\u00E7\u00E3o externalizados no cancelamento
BeamEnginesFlink.OptionsRetainExternalizedCheckpointsOnCancellation.ToolTip=Define o comportamento dos pontos de verifica\u00E7\u00E3o externalizados no cancelamento.
BeamEnginesFlink.OptionsRetryDelay.Label=Atraso na nova tentativa de execu\u00E7\u00E3o (ms)
BeamEnginesFlink.OptionsRetryDelay.ToolTip=Define o atraso em milissegundos entre as execu\u00E7\u00F5es. Um valor -1 indica que o valor padr\u00E3o deve ser usado.
BeamEnginesFlink.OptionsShutdownSourcesAfterIdleMs.Label=Desligar fontes na marca d'\u00E1gua final
BeamEnginesFlink.OptionsShutdownSourcesAfterIdleMs.ToolTip=Desliga fontes que ficaram inativas durante o tempo configurado de milissegundos. Depois que uma fonte for desligada, o ponto de verifica\u00E7\u00E3o n\u00E3o ser\u00E1 mais poss\u00EDvel. O encerramento das fontes eventualmente leva ao encerramento do pipeline (=o trabalho do Flink termina) depois que todas as entradas forem processadas. A menos que seja definido explicitamente, o padr\u00E3o ser\u00E1 Long.MAX_VALUE quando o ponto de verifica\u00E7\u00E3o estiver habilitado e 0 quando o ponto de verifica\u00E7\u00E3o estiver desabilitado. Consulte https://issues.apache.org/jira/browse/FLINK-2491 para ver o progresso nesta quest\u00E3o.
