#
# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#       http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
#
ActionMssqlBulkLoad.CheckConstraints.Tooltip=Indica que todas las restricciones en la tabla \u00F3 vista destino deben ser verificadas durante la carga masiva.\n Si est\u00E1 desactivada, las restricciones "CHECK" y "FOREIGN KEY" son ignoradas.
ActionMssqlBulkLoad.Lineterminated.Label=Fila terminada por\:
ActionMssqlBulkLoad.FireTriggers.Tooltip=Indica que se activen los disparadores de inserci\u00F3n definidos en la tabla durante la carga masiva.\n Si existen dichos disparadores, los mismos se disparar\u00E1n luego de cada lote insertado.
ActionMssqlBulkLoad.Filetype.All=Todos los archivos
ActionMssqlBulkLoad.KeepIdentity.Tooltip=Indica si se utilizar\u00E1n los valores de identidad \u00F3 los valores en el archivo importado para la columna identidad.
ActionMssqlBulkLoad.AddDateTime.Tooltip=A\u00F1adir fecha y hora al nombre del archivo de errores.
ActionMssqlBulkLoad.Error.DbNotMSSQL=La base de datos destino ({0}) no es un base MSSQL.
ActionMssqlBulkLoad.FileExists.Label=El archivo [{0}] existe.
ActionMssqlBulkLoad.StartFile.Tooltip=Comenzar a leer el archivo a partir de la l\u00EDnea indicada.
ActionMssqlBulkLoad.Schemaname.Tooltip=Nombre del esquema de la tabla. El nombre de esquema es opcional si el esquema\n por defecto del usuario realizando la carga masiva es el esquema de la tabla \u00F3 vista indicada.
ActionMssqlBulkLoad.SelectColumns.Message=Listado de columnas de la tabla
ActionMssqlBulkLoad.Truncate.Label=Truncar tabla
ActionMysqlBulkLoad.OrderDirectionDesc.Label=DESC
ActionMssqlBulkLoad.CheckConstraints.Label=Verificar restricciones
ActionMssqlBulkLoad.Truncate.Tooltip=Truncar la tabla antes de insertar los datos.
ActionMssqlBulkLoad.KeepNulls.Label=Mantener nulos
ActionMysqlBulkLoad.ErrorFilename.Tooltip=Indica el archivo utilizado para recolectar las filas que tengan errores de formato.\n Estas filas son copiados a este archivo de errores tal cual existen en el archivo de datos.\nEl archivo de error es creado cuando se ejecuta el comando.\nSi el archivo ya existe ocurrir\u00E1 un error.\nAdem\u00E1s, se crear\u00E1 un archivo de control con la extensi\u00F3n ".ERROR.txt".\n \u00C9ste hace referencia a cada registro en el archivo de error y provee diagn\u00F3sticos de los errores.
ActionMssqlBulkLoad.SelectColumns.Title=Listado de columnas de la tabla
ActionMssqlBulkLoad.ConnectionGroup.Group.Label=Tabla destino
ActionMssqlBulkLoad.AddFileToResult.Label=A\u00F1adir archivo a los archivos resultado
ActionMssqlBulkLoad.AddFileToResult.Tooltip=Seleccione esta opci\u00F3n si desea a\u00F1adir el archivo de salida\na los archivos resultado. Esto le permitir\u00E1 adjuntar al archivo a un email.
ActionMysqlBulkLoad.OrderDirectionAsc.Label=ASC
ActionMssqlBulkLoad.OrderBy.Label=Ordenar por\:
ActionMssqlBulkLoad.FieldTerminator.Tooltip=Indique el terminador de campos utilizado para archivos "char" y "widechar". El terminador por defecto es el tabulador.
ActionMysqlBulkLoad.DataFiletype.Label=Tipo de archivo
ActionMssqlBulkLoad.Error.OnlyLocalFileSupported=S\u00F3lo los archivos locales est\u00E1n soportados actualmente. El archivo [{0}] no es un archivo local.
ActionMssqlBulkLoad.MaxErrors.Label=M\u00E1ximo nro. de errores
ActionMysqlBulkLoad.OrderDirection.Label=Direcci\u00F3n
ActionMssqlBulkLoad.Tab.Advanced.Label=Avanzado
ActionMssqlBulkLoad.OrderBy.Tooltip=Indica c\u00F3mo est\u00E1n ordenados los datos en el archivo.\nLa operaci\u00F3n de carga masiva tendr\u00E1 mejor rendimiento si los datos a cargar est\u00E1n ordenados de acuerdo al \u00EDndice agrupado de la tabla.\nSi los datos est\u00E1n ordenados de maner a diferente, \u00F3 no existe un \u00EDndice agrupado en la tabla, la cl\u00E1usula "ORDER" es ignorada.\nLos nombres de columna provistos deben ser columnas v\u00E1lidas en la tabla destino.
ActionMssqlBulkLoad.BatchSize.Label=Tama\u00F1o del lote
ActionMssqlBulkLoad.SpecificCodePage.Label=P\u00E1gina de c\u00F3digos
ActionMssqlBulkLoad.UnexpectedError.Label=Ocurri\u00F3 un error inesperado\:
ActionMssqlBulkLoad.Tablename.Tooltip=El nombre de la tabla \u00F3 vista en la cual se realizar\u00E1 la carga masiva.
ActionMssqlBulkLoad.Schemaname.Label=Esquema destino\:
ActionMssqlBulkLoad.Filetype.Text=Archivos de texto
ActionMssqlBulkLoad.KeepIdentity.Label=Mantener la identidad
ActionMssqlBulkLoad.Error.TableNotExists=La tabla [{0}] no existe.
ActionMssqlBulkLoad.DataFileGroup.Group.Label=Archivo de datos
ActionMssqlBulkLoad.FormatFilename.Label=Archivo de formato
ActionMssqlBulkLoad.RowsPerBatch.Label=Filas por lote
ActionMssqlBulkLoad.Error.FieldTerminatorMissing=Falta el terminador de campo.
ActionMssqlBulkLoad.Tablename.Label=Nombre de la tabla destino\:
ActionMssqlBulkLoad.Tablock.Tooltip=Indica que se realizar\u00E1 un bloqueo a nivel de tabla durante la duraci\u00F3n de la carga masiva.\n Una tabla puede ser cargada concurrentemente por m\u00FAltiples clientes si la tabla no tiene \u00EDndices y se activa el bloqueo de tabla.
ActionMssqlBulkLoad.KeepNulls.Tooltip=Indica que las columnas vac\u00EDas deben retener los valores nulos durante la carga masiva\n en lugar de utilizar valores por defecto que hayan sido definidos.
ActionMssqlBulkLoad.FormatFilename.Tooltip=Indica la ruta completa del archivo de formato.\n Un archivo de formato describe describe al archivo de datos que contiene las respuestas generadas al utilizar la herramienta de carga masiva en la misma tabla \u00F3 vista.
ActionMssqlBulkLoad.ConnectionError2.DialogMessage=Por favor seleccione una conexi\u00F3n a base de datos v\u00E1lida.
ActionMssqlBulkLoad.Nodatabase.Label=No se ha definido una conexi\u00F3n a base de datos.
ActionMssqlBulkLoad.FieldTerminator.Label=Campos terminados por\:
ActionMssqlBulkLoad.Tablock.Label=Bloqueo de tabla
ActionMssqlBulkLoad.TableExists.Label=La tabla [{0}] existe.
ActionMssqlBulkLoad.Lineterminated.Tooltip=Indica el terminador de fila a utilizar para campos "char" y "widechar".
ActionMssqlBulkLoad.FireTriggers.Label=Activar disparadores
ActionMssqlBulkLoad.MaxErrors.Tooltip=Indica el n\u00FAmero m\u00E1ximo de errores de sintaxis permitido en los datos\n antes de cancelar la operaci\u00F3n de carga masiva.\n Cada fila que no pueda ser importada ser\u00E1 ignorada y contada como un error.
ActionMysqlBulkLoad.CodePage.Label=P\u00E1gina de c\u00F3digos
ActionMssqlBulkLoad.Filename.Tooltip=Ruta completa del archivo que contiene los datos a importar a la tabla indicada.
ActionMssqlBulkLoad.StartFile.Label=Comenzar en la l\u00EDnea
ActionMssqlBulkLoad.Title=Carga Masiva de MSSQL...
ActionMssqlBulkLoad.FileResult.Group.Label=Archivos resutado
ActionMssqlBulkLoad.Tab.General.Label=General
ActionMssqlBulkLoad.Nofilename.Label=No se a definido un nombre de archivo.
ActionMssqlBulkLoad.Filename.Label=Nombre del archivo origen\:
ActionMssqlBulkLoad.Error.FileNotExists=El archivo [{0}] no existe.
ActionMssqlBulkLoad.Name.Default=Carga Masiva de MSSQL
ActionMssqlBulkLoad.Filetype.Csv=Archivos CSV
ActionMysqlBulkLoad.ErrorFilename.Label=Archivo de error
ActionMssqlBulkLoad.BatchSize.Tooltip=Indica el n\u00FAmero de registros en un lote. Cada lote es copiado al servidor como una transacci\u00F3n.\n Si esto falla, SQL Server realiza el "commit" \u00F3 "roll back" de la transacci\u00F3n para cada lote.\nPor defecto, todos los datos en el archivo indicado son un \u00FAnico lote.
ActionMssqlBulkLoad.EndFile.Label=Finalizar en la l\u00EDnea
ActionMssqlBulkLoad.AddDateTime.Label=A\u00F1adir fecha y hora
ActionMssqlBulkLoad.Name.Label=Nombre de la entrada de trabajo\:
ActionMssqlBulkLoad.Error.ErrorFileExists=Error. El archivo ya existe. El archivo de error se crea al ejecutar el comando. Por favor elim\u00EDnelo \u00F3 utilice la opci\u00F3n "A\u00F1adir fecha y hora".
ActionMssqlBulkLoad.EndFile.Tooltip=Considerar que se alcanz\u00F3 el final del archivo cuando se alcanza la l\u00EDnea indicada.
ActionMssqlBulkLoad.Error.SpecificCodePageMissing=No se encuentra el c\u00F3digo de p\u00E1gina. Por favor indique un valor mayor a 127 \u00F3 menor a 32.
ActionMssqlBulkLoad.CodePage.Specific=Espec\u00EDfico
